
运算符执行先后顺序如下 \\
\begin{table}
\begin{tabular}{l  c}  
运算符 & 说明 \\ \hline
or & 逻辑或 \\ \hline
and & 逻辑与 \\ \hline
not & 逻辑非 \\ \hline
in, not in &	隶属关系 \\ \hline
is, is not	& 类型检测 \\ \hline
>, <=, >, >=, ==, !=, <>	 & 比较 \\ \hline
+, - &	加、减 \\ \hline
*, /, \%	& 乘、除、余 \\ \hline
**, $\wedge$	& 指数 \\ \hline
\end{tabular}
\end{table}
条件运算符，其返回值是布林值，即True或者False，以数值表示为1,0
==,<>,!=,<,<=,>,>= 
布林运算符，其返回值是True或者False，以数值表示则为1,0
not，and，or或与非运算符


第二种是使用var函数定义未赋值的符号变量，未赋值的符号变量在其定义区间内的值是任意的，默认情况下，使用var函数定义的变量是复数范围内的，注意在Sage中x是已经定义好的未赋值符号变量，可以直接使用。同时Sage定义了一个变量_用来接受上一次运算的结果。
比如
\begin{sagecommandline}
sage: var('y,z') #定义y，z两个符号变量
sage: z=x+y
sage: _+y
\end{sagecommandline}
reset函数可以取消定义，reset('y,z'),变量x取消后依然存在
含有符号变量的表达式又叫符号表达式，在z=x+y，x+y即为符号表达式，Symbolic Expression，我们可以对符号表达式中的变量赋值
\begin{sagecommandline}
sage: z=x+y
sage: z(x=2,y=3)
\end{sagecommandline}
如果符号表达式只有一个变量，则可以直接赋值，（未来将取消该功能）Substitution using function-call syntax and unnamed arguments is deprecated and will be removed from a future release of Sage; you can use named arguments instead, like EXPR(x=..., y=...)
\begin{sagecommandline}
sage: z=2x
sage: z(5)
\end{sagecommandline}

不同符号表达式可以进行运算，比如
\begin{sagecommandline}
sage: z=(x-y)*(x+y)
\end{sagecommandline}
利用expand()函数我们可以对其展开
\begin{sagecommandline}
sage: expand(z)
\end{sagecommandline}
也可以通过Python函数调用的方法来展开
\begin{sagecommandline}
sage: z.expand()
\end{sagecommandline}
结果为$x^2-y^2$,函数或函数调用并不会影响z本身的属性，此时z依然为$（x+y）（x-y）$，现在我们定义f=z.expand()
\begin{sagecommandline}
sage: f=z.expand()
\end{sagecommandline}
利用factor（）函数可以求取公因式
factor(f)或f.factor
factor函数同样可以分解数字
\begin{sagecommandline}
sage: factor(20)
\end{sagecommandline}

对于分式分解partial fraction expansion，我们可以利用factor函数求出公因式，然后自行分解，也可以利用partial.fraction对象？
\begin{sagecommandline}
sage: z=1/（x^2-1)
sage: z.partial_fraction()
\end{sagecommandline}
现在我们来看两个表达式
\begin{sagecommandline}
sage: z1=x^2+3*x+1
sage: z2=x^2+x+1
\end{sagecommandline}
多项式所在的环影响它的性质。因此对上面两个表达式进行因式分解，得到本身。可以发现，z1==0在实数范围内有解，z2==0在复数范围内有解，即这两个多项式可以通过先求其解来进行分解，当然我们也可以通过指定多项式其所在的“环”，然后用factor函数来分解 %
最简单的方法是
\begin{sagecommandline}
sage: R.<x>=CC[]
\end{sagecommandline}
这里R定义一个环，x定义一个域，域的区间为CC（复数域）QQ，RR等等
\begin{sagecommandline}
sage: z1.factor();z2.factor()
\end{sagecommandline}
对于z1,我们也可以仅将其变量定义在实数域中。
\begin{sagecommandline}
sage: R.<x>=RR[]
\end{sagecommandline}
需要指出，环由变量确定。相同域上的同一变量得到的环是等价的。
\begin{sagecommandline}
sage: R.<x>=QQ[];Z.<x>=QQ[]
sage: R==Z
\end{sagecommandline}
同样，我们可以直接在定义向量和矩阵时指定其所在的环。
向量
\begin{sagecommandline}
sage: v = vector(QQ, (1,2,3))
\end{sagecommandline}  

矩阵 
\begin{sagecommandline}
sage: Z = matrix(ZZ, [[2,0], [0,1]])
\end{sagecommandline}  
多项式化简
在Sage中多项式化简是自动的
\begin{sagecommandline}
sage: var(`y')
sage: z=x+y-y
sage: z
\end{sagecommandline}
使用Python的id函数可以查看变量在内存中的位置
\begin{sagecommandline}
sage: id(z);id(x)
\end{sagecommandline}
可见变量z的保存位置和变量x相同，当你输入一个多项式时，如果其可以简单化简，则是多项式实际是按照化简之后的形式保存的。
如果多项式不能直接化简，我们可以对其手动化简，这时用到simplify系列函数
\begin{sagecommandline}
sage: z = （x^2-1)^(1/2)/(x+1)^(1/2);show(z)
\end{sagecommandline}
可以看出这个式子可以化简，这里用到simplify_radical函数
\begin{sagecommandline}
sage: z.simplify_radical();show(_)
\end{sagecommandline}
simplify系列函数有很多个，在Sage中输入simplify，然后按下Tab键即可查看，对于每个函数，在函数名后输入？可以查看该函数的帮助信息，输入？？可以查看该函数的源代码。

我们可以通过solve（）函数求的方程的解
\begin{sagecommandline}
sage: var('a)
\end{sagecommandline}
求变量x;求变量a
\begin{sagecommandline}
sage: solve(x^2==a^2,x);solve(x^2==a^2,a)
\end{sagecommandline}
结果以列表的形式出现，列表是Python的内建数据类型，形式为[exp1, exp2, exp3,...]
方程组的求解也很容易
\begin{sagecommandline}
sage: var('a,b,c')
sage: solve([2*a+b-c==0,3*b-c==0,a+b==5],a,b,c)
\end{sagecommandline}
这里需注意，在Python语言中，除法公式5/2结果为2，这是因为5和2是整你形，所以其运算结果也是整形，Sage则返回5/2本身，不做改变，通过类型提升我们可以得到5/2的数字解
\begin{sagecommandline}
sage: float(5/2)
\end{sagecommandline}
sage也提供n（）函数，使用方法是n(5/2)或5/2.n(),n()中可以指定精度和位数，注意这里的精度并不是精确到小数点后面几位，而是浮点数中尾数的存储位数，默认Sage使用53bits。
n(5/3,prec=30,digits=8)指定5/3的结果精度为5，有8位有效数字

符号函数
在Python中元组通过圆括号中用逗号分割的项目定义。它和列表，字典同属序列，与列表不同，元祖中的对象既不能改变，也不能赋值。Sage引入了数学语法来定义函数，因此我们可以这样定义函数
f(x)=2*x
在这种情况下，括号中的x为函数f的参数，我们可以对其赋值：
\begin{sagecommandline}
f(2);f(4)....
\end{sagecommandline}
在表达式z=x+y中，实际上我们定义了z(x,y)=x+y
\begin{sagecommandline}
z(x=2,y=3)
\end{sagecommandline}

我们通常想得到一个函数的图像，使用plot函数可以方便的做出二维图形，这里有一个函数f(x)=x^2-10
plot(f(x),-10,10),这里-10,10为变量x的取值范围的闭区间，即为坐标轴中x的范围

Sage也能创建三维图像，显示三维图像默认都是调用开源软件包 [Jmol], 它支持使用鼠标旋转和缩放图像（需要Java运行环境）。这里有一个函数f(x,y)=x-sin(y)
\begin{sagecommandline}
plot3d(f(x,y),(x,-10,10),(y,-10,10))
\end{sagecommandline}
当我们使用z=plot(x^2,-1,1)时，这个过程只是定义变量z，并不会将结果显示出来，这里我们用到show函数。
\begin{sagecommandline}
z=plot(x^2,-1,1);show(z)
\end{sagecommandline}
show函数还可以显示手写格式的数学公式，这时实际是调用latex，上面我们已经用到了show函数。
\begin{sagecommandline}
z = （x^2-1)^(1/2)/(x+1)^(1/2);show(z)
\end{sagecommandline}

也可以把多个图像一起做图：
\begin{sagecommandline}
f1（x）=x
f2（x)=x^2-10
plot([f1(x),f2(x)],-10,10)
\end{sagecommandline}
我们看到f1和f2在[-10,10]的范围内有交点，现在我们求该交点,求交点的方法即是解方程的方法,上文我们用solve函数解代数方程，但是并不是所有的方程都有代数解，在这里我们find_root函数在区间内找到它的数值解。
\begin{sagecommandline}
f=f1(x)-f2(x)==0
f.find_root(0,10);f.find_root(-10,0) 
\end{sagecommandline}
find_root每次只会在给定区间内求出一个解，因此结合图像，我们可以细分区间，求出所有的交点。


在代数运算时，将变量当作明确的数值代入运算中。



微积分
变量在高等数学中有着非常重要的应用，以微积分为例
%微分/偏微分，积分，泰勒级数，
使用diff函数可以求函数的导数，微分和偏微分,基本格式为diff(函数，*偏微分变量，*微分阶次）
\begin{sagecommandline}
var(`y')
diff(sin(x));diff(sin(x-y),y);diff(sin(x),4);diff(sin(x-y),y,4)
也可以令z1=sin(x),z2=sin(x-y)使用调用的方法
z1.diff();z2.diff(y);z1.diff(4);z2,diff(y,4)
\end{sagecommandline}
%泰勒和罗伦斯级数
泰勒级数（Taylor series）用无限项连加式——级数来表示一个函数，这些相加的项由函数在某一点的导数求得。洛朗级数是泰勒级数的推广，它不仅包含了正数次数的项，也包含了负数次数的项。有时无法把函数表示为泰勒级数，但可以表示为洛朗级数。使用talyor函数可以快速的求出函数在某点上的泰勒或洛郎级数，下面是个例子。
\begin{sagecommandline}
(x - a)^n

"x, a, n" - variable, point, degree

x^2.taylor(x,1,6)
\end{sagecommandline}
函数x^2在x=1点上的六级泰勒级数，如果是-1级级数，则求出的是劳伦斯级数

使用integral函数可以求函数的积分，定积分和不定积分，基本格式是integral(函数，积分变量，*积分范围），对于高阶和多元函数的积分，可以通过叠加使用integral函数，注意在Matlab中int为积分符号，而在Python中int为取整，int(pi)=3.
\begin{sagecommandline}
var(`y')
integral(sin(x)，x);integral(sin(x-y),y);integral(sin(x),x,0,1);integral(integral(sin(x-y),x,0,1),y,0,1) %手写数学符号
\end{sagecommandline}
现在我们看这样的一个函数int(sin(x)e^-(st))
\begin{sagecommandline}
assume(s>0)
integrate(sin(x)*e^(-s*x),x,0,+Infinity)
1/(s^2 + 1)
\end{sagecommandline}
实际上int(sin(x)e^-(st))是sin（x）的拉普拉斯变换形式，拉普拉斯变换是应用数学中常用的一种积分变换，又名拉氏转换，在Sage中，拉式变换可以使用laplace函数，格式为laplace(f(x),x,s)，即对函数f(x)进行拉式变化，变换后的变量为s，拉式变换对应的反变换是inverse_laplace，格式为inverse_laplace(f(s),s,x)。下面是一个例子。
\begin{sagecommandline}
var(`s')
laplace(sin(x),x,s)
inverse_laplace(_,s,x)
\end{sagecommandline}

傅里叶变换是另一种一种线性的积分变换，常在将信号在时域（或空域）和频域之间变换时使用。Sage中并没有直接提供相应的函数支持，但我们可以根据傅里叶函数的形式使用积分来计算，有时候，根据拉普拉斯变换与傅里叶变换的相似性，我们还可以套用拉普拉斯变换来求傅里叶变换。实际上，由于傅里叶变换在物理学和工程学中的广泛应用，有很多专门的文献、资料涉及傅里叶变换，对于Sagemath和傅里叶变换的结合，读者可以参考Computational Fourier Transforms 一书，本文不再涉及，后续我也会通过专门的文章来探讨这个问题。

微分方程包括常微分方程和偏微分方程，两者都可以再分为线性和非线性两类，线性包括齐次和非齐次，使用desolve函数可以解一介和二阶线性微分方程。Solves a 1st or 2nd order linear ODE via maxima. Including IVP and BVP.
我们以desolve的帮助文档中的例子为例。

一阶微分方程
\begin{sagecommandline}
function('y', x) #定义y(x)，即y是变量x的函数
desolve(diff(y,x) + y - 1, y) #数学形式？，求y
(_C + e^x)*e^(-x) #结果
\end{sagecommandline}
这里用到了Sage调用Maxima的接口，所以它的输出看上去与其他Sage的输出略有不同。可以通过_.show()来显示出数学形式，？方便阅读。如果指定积分区间，ics - (optional) the initial or boundary conditions则我们可以进一步求出C
\begin{sagecommandline}
desolve(diff(y,x) + y - 1, y, ics=[10,2]); f
(e^10 + e^x)*e^(-x)
\end{sagecommandlinf.derivativee}
二阶微分方程
\begin{sagecommandline}
function('y', x)
diff(y,x,2) - y == x
desolve(de, y).show()
???_K2*e^(-x) + _K1*e^x - x
\end{sagecommandline}
请参考求解微分方程的方法（低阶到高阶的方法统计）http://wiki.sagemath.org/Differential_Equations

Sagemath是一个复杂的数学系统，一方面它包容了70多个成熟的开源数学工具，比如。。。，当我们需要在Sage中显性的调用这些工具时，我们也需要对其有一个初步的了解，另一方面，作为一个纯粹的学术工具，Sage缺乏像matlab中各种专业工具箱，不利于Sage在专业领域的发展，当然中文资料的匮乏也不利于Sagemath在国内的发展。但，Sagemath的开发速度很快？越来越多的人参与到这个开源数学工具的开发和推广上来，现在西方已经有很多人？开始在专业领域应用Sagemath，如果想进一步了解Sage，可以到其官网下载使用，或使用其在线版本，Sagemath目前已经是一个非常成熟的数学系统，在学术界接受程度很高，在很多大学？，国内？有应用，也多次作为演算工具，被各类论文引用，在目前反盗版，推荐国内各类高校部署和推广Sagemath。
\begin{thebibliography}{50}
\bibitem{变量} \url{http://zh.wikipedia.org/zh-cn/%E8%AE%8A%E6%95%B8}
\bibitem{Sage} \url{http://en.wikipedia.org/wiki/Sage_(mathematics_software)#cite_note-10}
\bibitem{Sage for Newbie}
\bibitem{环} \url{file:///home/yub/%E6%96%87%E6%A1%A3/Sagemath/tutorial/tour_rings.html http://localhost:8080/doc/live/reference/rings/sage/rings/ring.html}
\bibitem{精度} \url{http://zh.wikipedia.org/zh-cn/%E5%8F%8C%E7%B2%BE%E5%BA%A6%E6%B5%AE%E7%82%B9%E6%95%B0}
\bibitem{元祖} \url{http://woodpecker.org.cn/abyteofpython_cn/chinese/ch09s03.html}
\bibitem{做图} \url{file:///home/yub/%E6%96%87%E6%A1%A3/Sagemath/tutorial/tour_algebra.html#section-systems}
\bibitem{二元数学运算符优先级} \url{file:///home/yub/%E6%96%87%E6%A1%A3/Sagemath/tutorial/appendix.html#section-precedence}
\bibitem{变量数学} 数学的三个发展时期——变量数学时期（2008-01-24  转自《大科普网》） \url{http://www.pep.com.cn/gzsxb/xszx/czsxkwyd_1/czsxkwydsxgs/201009/t20100929_922925.htm}
\bibitem{微积分} \url{file:///home/yub/%E6%96%87%E6%A1%A3/Sagemath/tutorial/tour_algebra.html}
\bibitem{微积分} \url{calculus.pdf}
\bibitem{Sage工业应用网站} \url{http://vibrationdata.com/python-wiki/index.php?title=Main_Page}
\bibitem{Sage的发展博客} \url{http://blog.163.com/soft_share@126/blog/static/42983603201312592144105/}
\bibitem{Sage中定义的常量}
\bibitem{傅里叶变换} \url{http://zh.wikipedia.org/wiki/%E5%82%85%E9%87%8C%E5%8F%B6%E5%8F%98%E6%8D%A2}
\bibitem{拉普拉斯变换} \url{http://zh.wikipedia.org/zh-cn/%E6%8B%89%E6%99%AE%E6%8B%89%E6%96%AF%E5%8F%98%E6%8D%A2}
\bibitem{Sage Notebook服务器地址大全} \url{http://www.ai7.org/wp/html/904.html}
\bibitem{求解微分方程的方法（低阶到高阶的方法统计）} \url{http://wiki.sagemath.org/Differential_Equations}
\bibitem{微分方程} \url{http://zh.wikipedia.org/zh-cn/%E5%BE%AE%E5%88%86%E6%96%B9%E7%A8%8B}
\bibitem{Teaching_with_SAGE} \url{http://wiki.sagemath.org/Teaching_with_SAGE?highlight=%28fourier%29Computational} 
\bibitem{Computational Fourier Transforms} 
\bibitem{泰勒级数} \url{http://zh.wikipedia.org/wiki/%E6%B3%B0%E5%8B%92%E7%BA%A7%E6%95%B0}
\bibitem{洛郎级数} \url{http://zh.wikipedia.org/wiki/%E6%B4%9B%E6%9C%97%E7%BA%A7%E6%95%B0}
\end{thebibliography}
